tap "armmbed/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
tap "sanemat/font"
brew "anyenv"
brew "jpeg"
brew "readline"
brew "xz"
brew "python@3.9"
brew "glib"
brew "binutils"
brew "boost"
brew "bzip2"
brew "tcl-tk"
brew "cmake"
brew "cppcheck"
brew "eigen"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "freeglut"
brew "libmpc"
brew "gcc"
brew "git"
brew "gnuplot"
brew "gtk+3"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "libusb"
brew "python@3.10"
brew "mas"
brew "nano"
brew "neofetch"
brew "nmap"
brew "open-ocd"
brew "openblas"
brew "openjdk"
brew "openjdk@11"
brew "pyqt@5"
brew "qt"
brew "sl"
brew "smartmontools"
brew "tmux"
brew "wget"
brew "zlib"
brew "zplug"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "sanemat/font/ricty", args: ["with-powerline"]
cask "1password"
cask "alfred"
cask "apparency"
cask "appcleaner"
cask "atom"
cask "bartender"
cask "bettertouchtool"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "brewlet"
cask "discord"
cask "dropbox"
cask "git-credential-manager-core"
cask "github"
cask "google-chrome"
cask "grammarly"
cask "iina"
cask "inssider"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kicad"
cask "krisp"
cask "ltspice"
cask "mactex-no-gui"
cask "mbed-studio"
cask "mendeley"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "obs"
cask "parallels"
cask "parsec"
cask "pock"
cask "popclip"
cask "rectangle"
cask "skim"
cask "slack"
cask "splashtop-personal"
cask "splashtop-streamer"
cask "sublime-text"
cask "tabby"
cask "teamviewer"
cask "termius"
cask "the-unarchiver"
cask "tunnelblick"
cask "typora"
cask "unified-remote"
cask "unshaky"
cask "visual-studio-code"
cask "webex"
cask "wireshark"
cask "zoom"
mas "LanScan", id: 472226235
mas "LINE", id: 539883307
mas "Meeter", id: 1510445899
mas "RunCat", id: 1429033973
mas "Spark", id: 1176895641
mas "WireGuard", id: 1451685025
